[
  {
    "name": "Dr. P Chitra",
    "designation": "HOD",
    "imageUrl": "/chitra.jpg",
    "heading": "Dr. P Chitra - Head of Department",
    "description": "Dr. P. Chitra is a highly accomplished academician and researcher, currently holding the position of Head of the Department of Computer Science and Engineering Emerging technologies at SRM Institute of Science and Technology, Vadapalani Campus, Chennai. Her impressive academic credentials include a Doctorate in Information and Communication Engineering from Anna University, Chennai, awarded in 2013. Prior to that, she earned her M.E. in Computer Science and Engineering from Jerusalem College of Engineering, affiliated with Anna University, in 2006, and her B.E. in Computer Science and Engineering from Periyar Maniammai College of Engineering and Technology, under Bharathidasan University, in 1992. With nearly 30 years of professional experience, Dr. Chitra has cultivated a stellar reputation as an expert in both academia and industry.Her teaching career spans over 22 years, during which she has held various positions including Lecturer, Assistant Professor, Associate Professor, and now Professor. As a professor for more than nine years, she has been instrumental in developing and delivering curriculum that reflects the latest technological advancements, particularly in areas like Artificial Intelligence, Machine Learning, Data Mining, Natural Language Processing, Image Processing, and Information Security. Dr. Chitra’s career is further distinguished by her six years of industry experience, where she worked as a Systems Officer and Programmer, providing her with a unique blend of theoretical knowledge and practical insights. Her dual expertise in industry and academia enables her to offer a holistic approach to problem-solving in research and teaching, focusing on real-world applications of advanced computing technologies.Her research contributions are prolific and span multiple domains, particularly Artificial Intelligence and Machine Learning, where she has made significant strides in developing novel approaches and techniques. She has authored numerous papers in prestigious journals, many of which are indexed in Scopus and SCI. Some of her recent publications include groundbreaking work on the Internet of Things (IoT) and visible light communication, as well as innovative studies on improving energy production in photovoltaic arrays through advanced shadow detection techniques.Dr. Chitra’s commitment to research is further demonstrated by her involvement in numerous international conferences, where she has not only presented papers but also collaborated with researchers across the globe. Her recent contributions include works published in leading journals like Solar Energy, Springer, and IEEE conferences, with papers that address cutting-edge challenges in IoT, cloud computing, data science, and image processing.In addition to her research publications, Dr. Chitra has several patents to her name, underscoring her dedication to innovation and applied research. Her ability to translate complex theoretical concepts into practical applications has made her a leader in her field, and she continues to work on pioneering projects that advance both technology and its societal impact.Beyond her technical expertise, Dr. Chitra is a strong advocate for women in technology, frequently encouraging and mentoring female students to pursue careers in engineering and research. She believes in fostering an inclusive environment where diverse perspectives drive innovation and progress.Overall, Dr. P. Chitra stands as a prominent figure in the academic and research landscape, with a career marked by significant achievements in teaching, research and innovation."
  },
  {
    "name": "Dr. Meenakshi",
    "designation": "Club Coordinator",
    "imageUrl": "/meena.jpg",
    "heading": "Dr. Meenakshi - Club Coordinator",
    "description": "Dr. K. Meenakshi is an accomplished academic with over 20 years of experience in Computer Science and Engineering, recognized for her significant contributions to Cloud Server Storage Security and Blockchain Technology. She earned her Ph.D. in 2022 from Saveetha Institute of Medical and Technical Sciences, with a dissertation focused on Cloud Server Storage Security using Blockchain Technology, underscoring her expertise in cutting-edge security solutions. \n\nPrior to her Ph.D., Dr. Meenakshi completed her M.Tech. in Computer Science and Engineering at Dr. MGR Educational and Research Institute, Chennai, graduating with an impressive CGPA of 9.29 as the University’s Gold Medalist and First-Rank holder. She laid her academic foundation at Raja College of Engineering and Technology, Madurai Kamaraj University, where she earned her Bachelor of Engineering degree in Computer Science and Engineering with First Class Distinction, achieving 82%. \n\nDr. Meenakshi has held various academic roles throughout her career. Since June 2016, she has served as an Assistant Professor at SRM Institute of Science and Technology, Chennai, where she has made substantial contributions to both teaching and research. Prior to this, she worked as an Assistant Professor at Dr. MGR Educational and Research Institute, Chennai, from January 2011 to June 2016. She also served as a Lecturer at Vickram College of Engineering, Madurai, from May 2007 to October 2009, at PTR College of Engineering and Technology, Madurai, from June 2004 to April 2007, and at KLN College of Engineering, Madurai, from February 2004 to May 2004. \n\nAt SRM Institute of Science and Technology, Dr. Meenakshi has taught key subjects such as Computer Architecture, Database Management Systems, Design Thinking, Operating Systems, and Computer Networks. In addition to her teaching role, she is an active researcher and has organized several specialized workshops and conferences. She has published over 30 papers in well-regarded international journals and conferences, holds 4 patents, and has authored a book. Her research work is indexed in Scopus and other leading databases. \n\nDr. Meenakshi has organized numerous workshops and training programs addressing contemporary technological issues, demonstrating her commitment to bridging the gap between academia and industry. In March 2023, she completed a 3-day Design Thinking training program organized by the School of Design Thinking at Intellect, Chennai. Additionally, she completed the UHV-1 training program conducted by SRMIST, Kattankulathur, and the Network Security Fundamentals training program conducted by VIT in collaboration with Palo Alto Networks Ltd through the ICT Academy. \n\nBeyond the classroom, Dr. Meenakshi has played a pivotal role in coordinating major national and international technical symposia and conferences, enriching the academic atmosphere and fostering collaboration within the research community. Her dedication to advancing both technology and education has established her as a prominent figure in her field."
  }
  ,
  {
    "name": "Dr. Arun Nehru",
    "designation": "Club Coordinator",
    "imageUrl": "/arun.jpg",
    "heading": "Dr. Arun Nehru - Club Coordinator",
    "description": "Dr. J. Arun Nehru is a distinguished academic and researcher, currently serving as an Assistant Professor (Selection Grade) at Department of Computer Science and Engineering (ET), SRM Institute of Science and Technology, Chennai. With a career spanning over 14 years in the field of Computer Science and Engineering, Dr. Arun has established himself as a leading expert in several cutting-edge areas including computer vision, deep learning, machine learning, AWS cloud computing, and the Internet of Things (IoT).Dr. Arun began his academic journey with a Diploma in Computer Technology from Muthiah Polytechnic, Annamalai Nagar, where he graduated with First Class with Honours. He furthered his studies with a B.E. and M.E. in Computer Science & Engineering from Annamalai University. His pursuit of advanced knowledge led him to complete a highly recommended Ph.D. in Computer Science & Engineering at Annamalai University, where his research focused on intelligent suspicious activity detection in real-time video for surveillance applications.In his role at SRM Institute of Science and Technology, Dr. Arun is known for his strong commitment to teaching and mentoring, fostering an environment that encourages students to develop expertise in emerging technologies. His teaching repertoire includes subjects like Computer Graphics, System Software, Operating Systems, Artificial Intelligence, and Big Data Visualization. Dr. Arun's dedication to his field is reflected in his active participation in professional development through workshops, seminars, and conferences, as well as his affiliation with esteemed professional bodies such as ICTACT, IET, IAENG, IEDRC, and ISTE.Dr. Arun's technical skills are extensive, encompassing a wide range of operating systems, programming languages, developer applications, and machine learning tools. His proficiency in these areas supports his research and teaching, allowing him to bridge the gap between theoretical knowledge and practical application. His notable research contributions include over 70 publications in renowned international journals and conferences, focusing on real-time video surveillance, human activity recognition, emotion detection, and object tracking. His work is widely recognized, with publications indexed in Scopus and other leading databases. Dr. Arun's involvement in major research projects, such as a funded project on intelligent suspicious activity detection, highlights his ability to address real-world problems with innovative solutions. Beyond his professional achievements, he is admired for his organizational skills, leadership qualities, and his ability to build strong relationships with colleagues and students alike. His dedication to continuous learning and professional growth underscores his commitment to staying at the forefront of technological advancements and making meaningful contributions to the field of Computer Science and Engineering."
  }
]
